app/controllers/locations_controller.rb

INSERT INTO "locations" ("address", "admin_notes", "contact", "created_at", "donor_type", "hours", "is_donor", "lat", "lng", "name", "public_notes", "recip_category", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @location = Location.new(params[:location])
    @location.populate_detailed_hours_from_form params
    authorize! :create, @location
    # can't set admin bits from CRUD controls
    if @location.save

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @location = Location.find(params[:id])

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "locations" SET "updated_at" = '2012-06-22 21:43:42.957472', "address" = '2584 Baseline Road Boulder, CO 80305', "lat" = 40.0003102, "lng" = -105.2606561 WHERE "locations"."id" = 2
---
  def update
    @location = Location.find(params[:id])
    @location.populate_detailed_hours_from_form params
    authorize! :update, @location
    # can't set admin bits from CRUD controls
    if @location.update_attributes(params[:location])