app/controllers/logs_controller.rb

  def destroy
    @l = Log.find(params[:id])
    unless current_volunteer.any_admin? @l.region
      flash[:notice] = "Not authorized to delete log items for that region"
      redirect_to(root_path)
      return
    end
    @l.destroy
---
SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "logs" WHERE "logs"."id" = ?  [["id", 1]]

  def show
    @log = Log.find(params[:id])
    respond_to do |format|
      format.json {
        attrs = {}
        attrs[:log] = @log.attributes
        attrs[:log][:recipient_ids] = @log.recipient_ids
        attrs[:log][:volunteer_ids] = @log.volunteer_ids
	attrs[:log][:volunteer_names] = @log.volunteers.collect{ |v| v.name }
---
SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT 1  [["id", "null"]]
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = 13 LIMIT 1

  def edit
    @log = Log.find(params[:id])
    unless current_volunteer.any_admin? @log.region or @log.volunteers.include? current_volunteer
---
SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = 12 LIMIT 1

  def create_absence
    from = Date.new(params[:start_date][:year].to_i,params[:start_date][:month].to_i,params[:start_date][:day].to_i)
    to = Date.new(params[:stop_date][:year].to_i,params[:stop_date][:month].to_i,params[:stop_date][:day].to_i)
    volunteer = (params[:volunteer_id].nil?) ? current_volunteer : Volunteer.find(params[:volunteer_id].to_i)
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = 12 LIMIT 1

  def take
    unless params[:ids].present?
      l = [Log.find(params[:id])]
    else
      l = params[:ids].collect{ |i| Log.find(i) }
    end
    if l.all?{ |x| current_volunteer.regions.collect{ |r| r.id }.include? x.region_id }
      l.each{ |x|
        x.volunteers << current_volunteer
        x.save
      }
      flash[:notice] = "Successfully took a shift with #{l.length} donor(s)."
---
SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT 1  [["id", "7"]]
SELECT COUNT(*) FROM "logs"