app/controllers/logs_controller.rb

SELECT "schedules".* FROM "schedules" WHERE (volunteer_id = 12)
SELECT "logs".* FROM "logs" WHERE ("when" = '2012-06-26' AND schedule_id = 6)
INSERT INTO "logs" ("created_at", "description", "donor_id", "flag_for_admin", "notes", "num_reminders", "orig_volunteer_id", "recipient_id", "schedule_id", "transport", "updated_at", "volunteer_id", "weighed_by", "weight", "when") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create_absence
    from = Date.new(params[:start_date][:year].to_i,params[:start_date][:month].to_i,params[:start_date][:day].to_i)
    to = Date.new(params[:stop_date][:year].to_i,params[:stop_date][:month].to_i,params[:stop_date][:day].to_i)
    pickups = Schedule.where("volunteer_id = #{current_volunteer.id}")
    n = 0
    while from <= to
      pickups.each{ |p|
        if from.wday.to_i == p.day_of_week.to_i
          # make sure we don't create more than one for the same absence
          found = Log.where('"when" = ? AND schedule_id = ?',from,p.id)
          next if found.length > 0

          # create the null record
          lo = Log.new
          lo.orig_volunteer = current_volunteer
          lo.volunteer = nil
          lo.schedule = p
          lo.donor = p.donor
          lo.recipient = p.recipient
          lo.when = from
          lo.save

UPDATE "logs" SET "volunteer_id" = 12, "updated_at" = '2012-06-26 20:13:19.810390' WHERE "logs"."id" = 7
---
  def take
    l = Log.find(params[:id])
    l.volunteer = current_volunteer
    l.save