app/controllers/schedules_controller.rb

  def index(day_of_week=nil,volunteer_id=nil,otherq=nil)
    dowq = day_of_week.nil? ? "" : "AND day_of_week = #{day_of_week.to_i}"
    volq = volunteer_id.nil? ? "" : "AND volunteer_id = #{volunteer_id}"
    otherq = otherq.nil? ? "" : "AND #{otherq}"
    @volunteer_schedules = []
    @volunteer_schedules = Schedule.where("region_id IN (#{current_volunteer.assignments.collect{ |a| a.region_id }.join(",")}) #{dowq} #{volq} #{otherq}") unless current_volunteer.assignments.length == 0
---
SELECT COUNT(*) FROM "schedules" WHERE (volunteer_id = '13')

  def show
    @schedule = Schedule.find(params[:id])
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @schedule = Schedule.new(params[:schedule])
    unless current_volunteer.any_admin? @schedule.region
      flash[:notice] = "Not authorized to create schedule items for that region"
      redirect_to(root_path)
      return
    end
    if @schedule.save
---
INSERT INTO "schedules" ("admin_notes", "backup", "created_at", "day_of_week", "donor_id", "irregular", "needs_training", "prior_volunteer_id", "public_notes", "recipient_id", "time_start", "time_stop", "transport", "updated_at", "volunteer_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "volunteers" ("admin_notes", "created_at", "email", "gone_until", "has_car", "is_disabled", "name", "on_email_list", "phone", "pickup_prefs", "preferred_contact", "transport", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @schedule = Schedule.find(params[:id])
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @schedule = Schedule.find(params[:id])
    unless current_volunteer.any_admin? @schedule.region
      flash[:notice] = "Not authorized to edit schedule items for that region"
      redirect_to(root_path)
      return
    end
    if @schedule.update_attributes(params[:schedule])
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "schedules" SET "irregular" = 'f', "backup" = 'f', "updated_at" = '2012-06-26 15:46:12.809961', "admin_notes" = 'Testing123' WHERE "schedules"."id" = 1

  def take
    s = Schedule.find(params[:id])
    if current_volunteer.regions.collect{ |r| r.id }.include? s.region_id
      s.volunteer = current_volunteer
      s.temporary = false
      s.save
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "schedules" SET "volunteer_id" = 12, "updated_at" = '2012-06-26 20:21:04.987800' WHERE "schedules"."id" = 3