app/controllers/volunteers_controller.rb

  def index
    @volunteers = Volunteer.all.collect{ |v| (v.regions.collect{ |r| r.id } & current_volunteer.region_ids).length > 0 ? v : nil }.compact
---
SELECT COUNT(*) FROM "volunteers"

  def show
    @v = Volunteer.find(params[:id])
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = ? LIMIT 1  [["id", "list"]]

  def destroy
    @v = Volunteer.find(params[:id])
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = ? LIMIT 1  [["id", "8"]]

  def create
    @volunteer = Volunteer.new(params[:volunteer])
    return unless check_permissions(@volunteer)
    # can't set admin bits from CRUD controls
    @volunteer.admin = false
    @volunteer.assignments.each{ |r| r.admin = false }
    if @volunteer.save
---
INSERT INTO "volunteers" ("admin_notes", "created_at", "email", "gone_until", "has_car", "is_disabled", "name", "on_email_list", "phone", "pickup_prefs", "preferred_contact", "transport", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @volunteer = Volunteer.find(params[:id])
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @volunteer = Volunteer.find(params[:id])
    return unless check_permissions(@volunteer)
    # can't set admin bits from CRUD controls
    params[:volunteer].delete(:admin)
    params[:volunteer][:assignments].each{ |a| a.delete(:admin) } unless params[:volunteer][:assignments].nil?
    if @volunteer.update_attributes(params[:volunteer])
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "volunteers" SET "admin" = 't', "name" = 'Caleb Phillips', "transport" = 'Bike', "email" = 'cphillips@smallwhitecube.com', "has_car" = 'f', "preferred_contact" = 'Email', "is_disabled" = 'f', "phone" = '5038914985', "on_email_list" = 'f', "updated_at" = '2012-06-25 21:10:18.506006' WHERE "volunteers"."id" = 12