app/views/logs/new_absence.html.erb

  if current_volunteer.super_admin? %>
  <td><%= select_tag(:volunteer_id, options_for_select(Volunteer.find(:all, :order => 'name').collect{ |v|
          ["#{v.name} ["+v.regions.collect{ |r| r.name }.join(",")+"]",v.id] }),{:class => "select2"}) %></td>
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = 12 LIMIT 1